from collections import Counter
import string
import math
import re

# langue avec les lettre recent
LANG_FREQUENCIES = {
    'Esperanto': {'e': 14.0, 'a': 12.5, 'i': 8.5, 'n': 7.5, 'o': 7.0, 'r': 6.5, 's': 6.0, 't': 5.5, 'l': 5.0, 'd': 4.5, 'u': 4.0, 'm': 3.5, 'p': 3.0, 'g': 2.5, 'k': 2.0, 'v': 1.5, 'j': 1.0},
    'Spanish': {'e': 13.7, 'a': 12.5, 'i': 6.3, 'o': 8.7, 'n': 7.0, 'r': 6.9, 's': 7.9, 't': 4.6, 'l': 5.5, 'd': 5.0, 'u': 4.0, 'm': 3.5, 'c': 3.0, 'p': 2.5, 'g': 2.0, 'b': 1.5},
    'Portuguese': {'e': 13.5, 'a': 12.0, 'i': 6.5, 'o': 8.5, 'n': 7.0, 'r': 6.8, 's': 7.5, 't': 4.5, 'l': 5.0, 'd': 4.8, 'u': 4.0, 'm': 3.5, 'c': 3.0, 'p': 2.5, 'b': 2.0, 'v': 1.8, 'h': 1.5, 'g': 1.3, 'f': 1.2, 'q': 1.0},
    'Italian': {'e': 13.5, 'a': 12.0, 'i': 6.8, 'o': 8.5, 'n': 7.2, 'r': 6.8, 's': 7.0, 't': 4.8, 'l': 5.2, 'd': 4.5, 'u': 4.0, 'm': 3.5, 'c': 3.0, 'p': 2.5, 'b': 2.0, 'v': 1.8, 'h': 1.5, 'g': 1.3},
    'French': {'e': 14.7, 'a': 8.1, 'i': 7.3, 'o': 5.3, 'n': 7.1, 'r': 6.7, 's': 7.9, 't': 7.2, 'l': 5.5, 'u': 6.3, 'd': 4.5, 'm': 3.5, 'c': 3.0, 'p': 2.5, 'v': 2.0, 'f': 1.5, 'q': 1.0},
    'English': {'e': 12.7, 'a': 8.2, 'i': 7.0, 'o': 7.5, 'n': 6.7, 'r': 6.0, 's': 6.3, 't': 9.1, 'l': 4.0, 'd': 4.3, 'u': 3.5, 'm': 3.0, 'c': 2.8, 'p': 2.5, 'b': 2.0, 'g': 1.8, 'f': 1.5, 'h': 1.3, 'v': 1.0, 'y': 0.8, 'w': 0.5},
    'German': {'e': 16.9, 'a': 6.5, 'i': 7.6, 'o': 2.5, 'n': 9.8, 'r': 7.0, 's': 7.3, 't': 6.2, 'l': 3.4, 'd': 5.1, 'u': 4.0, 'm': 3.0, 'c': 2.8, 'h': 2.5, 'g': 2.0, 'k': 1.8, 'z': 1.5, 'v': 1.0, 'w': 0.8},
    'Dutch': {'e': 15.0, 'a': 7.5, 'i': 6.5, 'n': 9.0, 'o': 6.0, 'r': 6.5, 's': 6.0, 't': 5.5, 'l': 4.0, 'd': 4.5, 'u': 3.5, 'm': 3.0, 'c': 2.5, 'p': 2.0, 'b': 1.8, 'h': 1.5, 'g': 1.3, 'k': 1.0, 'v': 0.8, 'w': 0.7, 'z': 0.6, 'j': 0.5},
    'Swedish': {'e': 13.0, 'a': 11.0, 'i': 6.0, 'n': 8.5, 'o': 5.5, 'r': 6.0, 's': 5.5, 't': 5.0, 'l': 4.5, 'd': 4.0, 'u': 3.5, 'm': 3.0, 'c': 1.5, 'p': 1.3, 'h': 2.0, 'g': 1.8, 'k': 1.5, 'v': 1.3, 'b': 1.0, 'f': 0.8, 'å': 0.7, 'ä': 0.6, 'ö': 0.5},
    'Polish': {'e': 13.0, 'a': 10.5, 'i': 7.0, 'n': 7.5, 'o': 6.5, 'r': 5.5, 's': 5.0, 't': 4.5, 'l': 4.0, 'd': 3.5, 'u': 3.0, 'm': 2.8, 'c': 2.5, 'p': 2.3, 'h': 2.0, 'g': 1.8, 'k': 1.5, 'b': 1.3, 'z': 1.0, 'y': 0.8, 'w': 0.7, 'j': 0.5},
    'Turkish': {'e': 12.5, 'a': 11.0, 'i': 6.5, 'n': 7.0, 'o': 5.5, 'r': 5.0, 's': 4.5, 't': 4.0, 'l': 3.5, 'd': 3.0, 'u': 2.8, 'm': 2.5, 'h': 2.3, 'g': 2.0, 'k': 1.8, 'b': 1.5, 'z': 1.3, 'y': 1.0, 'ç': 0.8, 'ğ': 0.7, 'ı': 0.6, 'ş': 0.5, 'ü': 0.4, 'ö': 0.3}
}

# les difference dans les lettres
LANG_ORDER = {
    "Esperanto": "eainorstldumpgkfvj",
    "Spanish":   "eaionrstldumcpgb",
    "Portuguese":"eaionrstldumcpbvhgfq",
    "Italian":   "eaionrstldumcpbvhg",
    "French":    "eaionrstldumcpvfq",
    "English":   "eaionrstldumcpbgfhvyw",
    "German":    "eaionrstldumcpbgfhkzvw",
    "Dutch":     "eaionrstldumcpbgfhkvwzj",
    "Swedish":   "eaionrstldumcpbgfhkvwåäö",
    "Polish":    "eaionrstldumcpbgfhkvwzjy",
    "Turkish":   "eaionrstldumcpbgfhkvwçyöğü"
}
